# -*- coding: utf-8 -*- 
# @Time : 2021/1/20 11:33 
# @Author : dujun
# @describe : 各省份数据
# @File : province.py 

##考生类型
sut = {
    'stuType': 1
}

province = {
    '北京市': '110000',  # 0
    '辽宁省': '210000',  # 1
    '吉林省': '220000',  # 2
    '黑龙江省': '230000',  # 3
    '河南省': '410000',  # 4
    '甘肃省': '620000',  # 5
    '青海省': '630000',  # 6
    '宁夏回族自治区': '640000',  # 7
    '新疆维吾尔自治区': '650000',  # 8
    '陕西省': '610000',  # 9
    '河北省': '130000',  # 10
    '内蒙古自治区': '150000',  # 11
    '湖北省': '420000',  # 12
    '重庆市': '500000',  # 13
    '四川省': '510000',  # 14
    '云南省': '530000',  # 15
    '西藏自治区': '540000',  # 16
    '天津市': '120000',  # 17
    '山西省': '140000',  # 18
    '山东省': '370000',  # 19
    '浙江省': '330000',  # 20
    '上海市': '310000',  # 21
    '江苏省': '320000',  # 22
    '安徽省': '340000',  # 23
    '湖南省': '430000',  # 24
    '江西省': '360000',  # 25
    '福建省': '350000',  # 26
    '广东省': '440000',  # 27
    '广西壮族自治区': '450000',  # 28
    '海南省': '460000',  # 29
    '贵州省': '520000'  # 30
}


def shenFen(mark=''):
    shenValue = province[mark]
    shenKeys = list(province.keys())
    shenValueIndex = shenKeys.index(mark)
    shenKey = shenKeys[shenValueIndex]
    return shenKey, shenValue


if __name__ == "__main__":
    print(shenFen("贵州省")[0])
